BeanShellSampler-Funciones.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.4.1">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">10</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">10</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <RandomVariableConfig guiclass="TestBeanGUI" testclass="RandomVariableConfig" testname="Random Variable1" enabled="true">
          <stringProp name="maximumValue">10</stringProp>
          <stringProp name="minimumValue">1</stringProp>
          <boolProp name="perThread">false</boolProp>
          <stringProp name="variableName">r1</stringProp>
        </RandomVariableConfig>
        <hashTree/>
        <BeanShellSampler guiclass="BeanShellSamplerGui" testclass="BeanShellSampler" testname="BeanShell Sampler" enabled="true">
          <stringProp name="BeanShellSampler.query">int r1 = Integer.parseInt(vars.get(&quot;r1&quot;));
int r2 = Integer.parseInt(vars.get(&quot;r2&quot;));

int suma(r1, r2){
	return r1+r2;
};

int resta(r1, r2){
	return r1-r2;
};

int multiplicacion(r1, r2){
	return r1*r2;
};

float division(r1, r2){
	try{
		return r1/r2;
	}catch(e){ 
		IsSuccess = false;
		print(e);
		}
};

resultadoSuma = suma(r1, r2);
resultadoResta = resta(r1, r2);
resultadoMultiplicacion = multiplicacion(r1, r2);
resultadoDivision = division(r1, r2);
print(&quot;Suma: &quot; + resultadoSuma);
print(&quot;Resta: &quot; + resultadoResta);
print(&quot;Multiplicacion: &quot; + resultadoMultiplicacion);
print(&quot;Division: &quot; + resultadoDivision);
ResponseMessage = &quot; Suma: &quot; + resultadoSuma + &quot;\n Resta:&quot; + 
				resultadoResta + &quot;\n Multiplicacion: &quot; + resultadoMultiplicacion + &quot;\n Division: &quot; + resultadoDivision;
</stringProp>
          <boolProp name="BeanShellSampler.resetInterpreter">false</boolProp>
        </BeanShellSampler>
        <hashTree/>
        <RandomVariableConfig guiclass="TestBeanGUI" testclass="RandomVariableConfig" testname="Random Variable2" enabled="true">
          <stringProp name="variableName">r2</stringProp>
          <stringProp name="minimumValue">1</stringProp>
          <stringProp name="maximumValue">10</stringProp>
          <boolProp name="perThread">false</boolProp>
        </RandomVariableConfig>
        <hashTree/>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>